; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=153, out_folder=./training, instance_id=11, seed=2035, goal_proportion=0.03

(define (problem blocksworld-11)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b138)
    (on b138 b106)
    (on b106 b118)
    (on-table b118)
    (clear b39)
    (on b39 b13)
    (on-table b13)
    (clear b86)
    (on b86 b15)
    (on b15 b11)
    (on b11 b112)
    (on b112 b14)
    (on b14 b107)
    (on b107 b136)
    (on-table b136)
    (clear b31)
    (on b31 b116)
    (on b116 b97)
    (on b97 b150)
    (on b150 b7)
    (on-table b7)
    (clear b120)
    (on b120 b53)
    (on b53 b22)
    (on b22 b83)
    (on-table b83)
    (clear b65)
    (on-table b65)
    (clear b5)
    (on b5 b140)
    (on b140 b49)
    (on b49 b34)
    (on b34 b103)
    (on b103 b50)
    (on b50 b72)
    (on b72 b21)
    (on b21 b108)
    (on b108 b30)
    (on-table b30)
    (clear b61)
    (on-table b61)
    (clear b130)
    (on-table b130)
    (clear b57)
    (on b57 b26)
    (on-table b26)
    (clear b101)
    (on-table b101)
    (clear b100)
    (on b100 b75)
    (on b75 b84)
    (on-table b84)
    (clear b143)
    (on b143 b64)
    (on b64 b55)
    (on b55 b42)
    (on b42 b70)
    (on b70 b85)
    (on-table b85)
    (clear b58)
    (on-table b58)
    (clear b90)
    (on b90 b69)
    (on-table b69)
    (clear b52)
    (on b52 b151)
    (on b151 b129)
    (on b129 b36)
    (on b36 b139)
    (on b139 b137)
    (on b137 b111)
    (on b111 b46)
    (on b46 b43)
    (on b43 b141)
    (on b141 b88)
    (on b88 b149)
    (on b149 b1)
    (on b1 b60)
    (on b60 b54)
    (on-table b54)
    (clear b32)
    (on b32 b87)
    (on b87 b19)
    (on-table b19)
    (clear b104)
    (on b104 b144)
    (on-table b144)
    (clear b142)
    (on b142 b3)
    (on b3 b66)
    (on b66 b153)
    (on b153 b131)
    (on b131 b29)
    (on b29 b35)
    (on b35 b74)
    (on b74 b2)
    (on b2 b59)
    (on b59 b10)
    (on-table b10)
    (clear b99)
    (on b99 b51)
    (on b51 b37)
    (on b37 b124)
    (on b124 b40)
    (on-table b40)
    (clear b92)
    (on b92 b115)
    (on-table b115)
    (clear b91)
    (on b91 b125)
    (on b125 b76)
    (on-table b76)
    (clear b38)
    (on b38 b145)
    (on b145 b6)
    (on b6 b89)
    (on b89 b93)
    (on b93 b80)
    (on b80 b24)
    (on b24 b126)
    (on b126 b119)
    (on b119 b117)
    (on b117 b146)
    (on-table b146)
    (clear b114)
    (on b114 b81)
    (on-table b81)
    (clear b20)
    (on b20 b67)
    (on-table b67)
    (clear b63)
    (on b63 b152)
    (on b152 b122)
    (on b122 b135)
    (on b135 b102)
    (on b102 b8)
    (on b8 b78)
    (on b78 b4)
    (on b4 b148)
    (on b148 b113)
    (on b113 b71)
    (on b71 b48)
    (on b48 b95)
    (on-table b95)
    (clear b133)
    (on b133 b47)
    (on b47 b123)
    (on-table b123)
    (clear b33)
    (on b33 b110)
    (on b110 b105)
    (on-table b105)
    (clear b28)
    (on b28 b41)
    (on b41 b12)
    (on b12 b109)
    (on b109 b121)
    (on b121 b147)
    (on b147 b94)
    (on b94 b132)
    (on-table b132)
    (clear b73)
    (on-table b73)
    (clear b17)
    (on b17 b62)
    (on b62 b68)
    (on-table b68)
    (clear b45)
    (on b45 b98)
    (on b98 b25)
    (on-table b25)
    (clear b127)
    (on b127 b134)
    (on-table b134)
    (clear b82)
    (on b82 b56)
    (on b56 b23)
    (on b23 b96)
    (on b96 b27)
    (on b27 b79)
    (on-table b79)
    (clear b128)
    (on b128 b9)
    (on b9 b18)
    (on b18 b44)
    (on b44 b77)
    (on-table b77))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b1)
    (on b1 b4)
    (on-table b4))))

; plan
1. (unstack b142 b3)
   deleted: (on b142 b3) (clear b142) (arm-empty)
   added: (holding b142) (clear b3)
   goals met: 0 of 5
2. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 0 of 5
3. (unstack b52 b151)
   deleted: (on b52 b151) (clear b52) (arm-empty)
   added: (holding b52) (clear b151)
   goals met: 0 of 5
4. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 0 of 5
5. (unstack b151 b129)
   deleted: (on b151 b129) (clear b151) (arm-empty)
   added: (holding b151) (clear b129)
   goals met: 0 of 5
6. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 0 of 5
7. (unstack b129 b36)
   deleted: (on b129 b36) (clear b129) (arm-empty)
   added: (holding b129) (clear b36)
   goals met: 0 of 5
8. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 0 of 5
9. (unstack b36 b139)
   deleted: (on b36 b139) (clear b36) (arm-empty)
   added: (holding b36) (clear b139)
   goals met: 0 of 5
10. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 0 of 5
11. (unstack b139 b137)
   deleted: (on b139 b137) (clear b139) (arm-empty)
   added: (holding b139) (clear b137)
   goals met: 0 of 5
12. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 0 of 5
13. (unstack b137 b111)
   deleted: (on b137 b111) (clear b137) (arm-empty)
   added: (holding b137) (clear b111)
   goals met: 0 of 5
14. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 0 of 5
15. (unstack b111 b46)
   deleted: (on b111 b46) (clear b111) (arm-empty)
   added: (holding b111) (clear b46)
   goals met: 0 of 5
16. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 0 of 5
17. (unstack b46 b43)
   deleted: (on b46 b43) (clear b46) (arm-empty)
   added: (holding b46) (clear b43)
   goals met: 0 of 5
18. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 0 of 5
19. (unstack b43 b141)
   deleted: (on b43 b141) (clear b43) (arm-empty)
   added: (holding b43) (clear b141)
   goals met: 0 of 5
20. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 0 of 5
21. (unstack b141 b88)
   deleted: (on b141 b88) (clear b141) (arm-empty)
   added: (holding b141) (clear b88)
   goals met: 0 of 5
22. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 0 of 5
23. (unstack b63 b152)
   deleted: (on b63 b152) (clear b63) (arm-empty)
   added: (holding b63) (clear b152)
   goals met: 0 of 5
24. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 0 of 5
25. (unstack b152 b122)
   deleted: (on b152 b122) (clear b152) (arm-empty)
   added: (holding b152) (clear b122)
   goals met: 0 of 5
26. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 0 of 5
27. (unstack b122 b135)
   deleted: (on b122 b135) (clear b122) (arm-empty)
   added: (holding b122) (clear b135)
   goals met: 0 of 5
28. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 0 of 5
29. (unstack b135 b102)
   deleted: (on b135 b102) (clear b135) (arm-empty)
   added: (holding b135) (clear b102)
   goals met: 0 of 5
30. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 0 of 5
31. (unstack b102 b8)
   deleted: (on b102 b8) (clear b102) (arm-empty)
   added: (holding b102) (clear b8)
   goals met: 0 of 5
32. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 0 of 5
33. (unstack b8 b78)
   deleted: (on b8 b78) (clear b8) (arm-empty)
   added: (holding b8) (clear b78)
   goals met: 0 of 5
34. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 5
35. (unstack b78 b4)
   deleted: (on b78 b4) (clear b78) (arm-empty)
   added: (holding b78) (clear b4)
   goals met: 0 of 5
36. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 0 of 5
37. (unstack b4 b148)
   deleted: (on b4 b148) (clear b4) (arm-empty)
   added: (holding b4) (clear b148)
   goals met: 0 of 5
38. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 5
39. (unstack b88 b149)
   deleted: (on b88 b149) (clear b88) (arm-empty)
   added: (holding b88) (clear b149)
   goals met: 1 of 5
40. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 1 of 5
41. (unstack b149 b1)
   deleted: (on b149 b1) (clear b149) (arm-empty)
   added: (holding b149) (clear b1)
   goals met: 1 of 5
42. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 1 of 5
43. (unstack b3 b66)
   deleted: (on b3 b66) (clear b3) (arm-empty)
   added: (holding b3) (clear b66)
   goals met: 1 of 5
44. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 2 of 5
45. (unstack b66 b153)
   deleted: (on b66 b153) (clear b66) (arm-empty)
   added: (holding b66) (clear b153)
   goals met: 2 of 5
46. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 5
47. (unstack b153 b131)
   deleted: (on b153 b131) (clear b153) (arm-empty)
   added: (holding b153) (clear b131)
   goals met: 2 of 5
48. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 2 of 5
49. (unstack b131 b29)
   deleted: (on b131 b29) (clear b131) (arm-empty)
   added: (holding b131) (clear b29)
   goals met: 2 of 5
50. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 2 of 5
51. (unstack b29 b35)
   deleted: (on b29 b35) (clear b29) (arm-empty)
   added: (holding b29) (clear b35)
   goals met: 2 of 5
52. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 5
53. (unstack b35 b74)
   deleted: (on b35 b74) (clear b35) (arm-empty)
   added: (holding b35) (clear b74)
   goals met: 2 of 5
54. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 5
55. (unstack b74 b2)
   deleted: (on b74 b2) (clear b74) (arm-empty)
   added: (holding b74) (clear b2)
   goals met: 3 of 5
56. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 3 of 5
57. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 2 of 5
58. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 5
59. (unstack b1 b60)
   deleted: (on b1 b60) (clear b1) (arm-empty)
   added: (holding b1) (clear b60)
   goals met: 2 of 5
60. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 3 of 5
61. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 5
62. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 4 of 5
63. (unstack b2 b59)
   deleted: (on b2 b59) (clear b2) (arm-empty)
   added: (holding b2) (clear b59)
   goals met: 3 of 5
64. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 5
